# 3. Напишите программу, в которой пользователь будет задавать две строки,
# программа - определяет количество вхождений одной строки в другую.

a = input('Введите a: ')
b = input('Введите b: ')
print (a.count(b))

